In [47]:
import numpy as np
import pandas as pd

In [48]:
#Pandas operations
#Conditional selection
#Access rows & col's
#Add & delete columns
#Concatenation merging and joining dataframe
#Handling missing values
#apply()

In [49]:
d={'USN':[11,12,13,14,15],
  'NAME':['KATTY','POOJA','DARSHAN','NITISH','SIMRAN'],
  'MOBILE':[23456,48373,34983,87432,34897],
  'MARKS':[40,46,39,45,42]
  }

In [50]:
std=pd.DataFrame(d)

In [51]:
std

   USN     NAME  MOBILE  MARKS
0   11    KATTY   23456     40
1   12    POOJA   48373     46
2   13  DARSHAN   34983     39
3   14   NITISH   87432     45
4   15   SIMRAN   34897     42

In [52]:
#DataFrame operations
std.head(2)
#head - displaying rows
#display all by default
#parameters passed, display rows as per para

   USN   NAME  MOBILE  MARKS
0   11  KATTY   23456     40
1   12  POOJA   48373     46

In [53]:
std.columns
#list of columns in my df

Index(['USN', 'NAME', 'MOBILE', 'MARKS'], dtype='object')

In [54]:
std.info()
#gives all the information about my df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     5 non-null      int64
 1   NAME    5 non-null      object
 2   MOBILE  5 non-null      int64
 3   MARKS   5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

In [55]:
std.isnull()
#gives the boolean value of the df

     USN   NAME  MOBILE  MARKS
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False
3  False  False   False  False
4  False  False   False  False

In [56]:
std

   USN     NAME  MOBILE  MARKS
0   11    KATTY   23456     40
1   12    POOJA   48373     46
2   13  DARSHAN   34983     39
3   14   NITISH   87432     45
4   15   SIMRAN   34897     42

In [57]:
#access columns
std['USN']

0    11
1    12
2    13
3    14
4    15
Name: USN, dtype: int64

In [58]:
#access multiple columns
std[['USN','MARKS','MOBILE']]

   USN  MARKS  MOBILE
0   11     40   23456
1   12     46   48373
2   13     39   34983
3   14     45   87432
4   15     42   34897

In [59]:
std

   USN     NAME  MOBILE  MARKS
0   11    KATTY   23456     40
1   12    POOJA   48373     46
2   13  DARSHAN   34983     39
3   14   NITISH   87432     45
4   15   SIMRAN   34897     42

In [60]:
#access rows
std.loc[1]
#returns row

USN          12
NAME      POOJA
MOBILE    48373
MARKS        46
Name: 1, dtype: object

In [61]:
std.iloc[2]
#returns second row

USN            13
NAME      DARSHAN
MOBILE      34983
MARKS          39
Name: 2, dtype: object

In [62]:

index=['A','B','C','D','E']
std.set_index('USN')

        NAME  MOBILE  MARKS
USN
11     KATTY   23456     40
12     POOJA   48373     46
13   DARSHAN   34983     39
14    NITISH   87432     45
15    SIMRAN   34897     42

In [63]:
std.iloc[2]

USN            13
NAME      DARSHAN
MOBILE      34983
MARKS          39
Name: 2, dtype: object

In [64]:
#conditional selection 
print(std['MARKS']<45)
#this attritbute returns the boolean value of the given df in the form od true or false.

0     True
1    False
2     True
3    False
4     True
Name: MARKS, dtype: bool

In [65]:
(std['MARKS']<45)

0     True
1    False
2     True
3    False
4     True
Name: MARKS, dtype: bool

In [66]:
std['MARKS']<45

0     True
1    False
2     True
3    False
4     True
Name: MARKS, dtype: bool

In [67]:
#the last three syntax's give the same output.

In [68]:
newdf=(std['MARKS']<45)

In [69]:
std[newdf]
#it makes a new table with the true values.

   USN     NAME  MOBILE  MARKS
0   11    KATTY   23456     40
2   13  DARSHAN   34983     39
4   15   SIMRAN   34897     42

In [70]:
std[newdf]['NAME']

0      KATTY
2    DARSHAN
4     SIMRAN
Name: NAME, dtype: object

In [71]:
#multiple conditions
std[(std['NAME']=='POOJA')
    &(std['MARKS']>39)]

   USN   NAME  MOBILE  MARKS
1   12  POOJA   48373     46

In [72]:
p={'USN':[11,12,13,14,15],
  'NAME':['KATTY','POOJA','DARSHAN','NITISH','SIMRAN'],
  'MOBILE':[23456,48373,34983,87432,34897],
  'MARKS':[40,46,39,45,None]
  }

In [73]:
std[(std['USN']>13)
     &(std['MARKS']<50)]

   USN    NAME  MOBILE  MARKS
3   14  NITISH   87432     45
4   15  SIMRAN   34897     42

In [74]:
#adding a new column
s=['banglore','delhi','punjab','orissa','bihar' .split(',')]
print(s,type(s))

['banglore', 'delhi', 'punjab', 'orissa', ['bihar']] <class 'list'>

In [75]:
std['address']=s

In [76]:
std

   USN     NAME  MOBILE  MARKS   address
0   11    KATTY   23456     40  banglore
1   12    POOJA   48373     46     delhi
2   13  DARSHAN   34983     39    punjab
3   14   NITISH   87432     45    orissa
4   15   SIMRAN   34897     42   [bihar]

In [79]:
std.drop("address",axis=1,inplace=True)
std.head()

   USN     NAME  MOBILE  MARKS
0   11    KATTY   23456     40
1   12    POOJA   48373     46
2   13  DARSHAN   34983     39
3   14   NITISH   87432     45
4   15   SIMRAN   34897     42

In [ ]:
std.drop(2)

In [ ]:
d2={'USN':[11,12,13,14,15],
  'NAME':['POOJA','DARSHAN','NITISH','SIMRAN',None],
  'MOBILE':[23456,48373,34983,87432,None],
  'MARKS':[40,46,None,39,45]
  }

In [ ]:
df=pd.DataFrame(d2)

In [ ]:
df

In [ ]:
df.dropna(thresh=2)